&НаКлиенте
Перем мТокен;
&НаКлиенте
Перем мEmail;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДанныеСессии = ВосстановитьСессиюНаСервере();
    
	Если ДанныеСессии <> Неопределено Тогда
	    мТокен = ДанныеСессии.Токен;
	    мEmail = ДанныеСессии.Email;	   
	    
	    Если ЗначениеЗаполнено(мТокен) Тогда
	        Сообщить("Сессия восстановлена. Email: " + мEmail);
	        
	    КонецЕсли;
	КонецЕсли;
	
	HTML = "https://srv200.tail6b04b6.ts.net/v1/";
	ПодключитьОбработчикОжидания("ПроверитьЗаголовокHTML", 1,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаголовокHTML() Экспорт
    
    Попытка        
        ЭлементDOM = Элементы.HTML.Документ.getElementById("authData1C");
        
        Если ЭлементDOM <> Неопределено Тогда
            ТекстДанных = ЭлементDOM.textContent;
            
            Если ЗначениеЗаполнено(ТекстДанных) 
                И СтрНайти(ТекстДанных, "LoginSuccess") > 0 Тогда
                
                Попытка
                    ЧтениеJSON = Новый ЧтениеJSON;
                    ЧтениеJSON.УстановитьСтроку(ТекстДанных);
                    ДанныеВхода = ПрочитатьJSON(ЧтениеJSON);
                    ЧтениеJSON.Закрыть();
                    
                    мТокен = ДанныеВхода.token;
                    мEmail = ДанныеВхода.email;       
                    
                    ЭлементDOM.textContent = "";                    
                    
                    ОтключитьОбработчикОжидания("ПроверитьЗаголовокHTML");
                    
                    СохранитьСессиюНаСервере(мТокен,мEmail);
					
					ЭтаФорма.Закрыть();
                Исключение
                    Сообщить("Ошибка парсинга JSON: " + ОписаниеОшибки());
                КонецПопытки;
                
            КонецЕсли;
        КонецЕсли;
        
    Исключение
    КонецПопытки;
    
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьСессиюНаСервере(Токен, Email)
    
    Данные = Новый Структура("Токен, Email", Токен, Email);    
   
    ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
    КлючНастроек = "Session_" + ИмяПользователя;
    
    ХранилищеОбщихНастроек.Сохранить("SaaSAuth", КлючНастроек, Данные);
    
КонецПроцедуры

&НаСервере
Функция ВосстановитьСессиюНаСервере()
    
    ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
    КлючНастроек = "Session_" + ИмяПользователя;
    
    Данные = ХранилищеОбщихНастроек.Загрузить("SaaSAuth", КлючНастроек);
    
    Возврат Данные;
    
КонецФункции